Revit 2027 API
ElementRecord.IsAnElementType Method
 Identifies if the element record represents an ElementType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAnElementType()
Public Function IsAnElementType As Boolean
public:
bool IsAnElementType()
member IsAnElementType : unit -> bool
Return Value
Boolean
 True if the element record represents an ElementType.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace